##TP LINK KAPA-KAPA SESSION##

#Trunk configuration

conf
switchport general allowed vlan (ID) tagged
switchport general allowed vlan all

#Access configuration

conf t
switchport general allowed  vlan (ID) untagged
switchport pvid (id)


=======================================================================================================================================================================================

SG3428(config)#hostname 
hostname            

SG3428(config)#hostname MAINSW
               
FSD_Managed_sW(config)#show running-config 
running-config      

FSD_Managed_sW(config)#show running-config 
!SG3428

vlan 10

vlan 120

hostname "FSD_Managed_sW"
serial_port baud_rate 38400

system-time ntp UTC+08:00 139.78.100.163 199.165.76.11 12 140.142.16.34 128.138.140.44 129.7.1.66 
no system-time dst

user name admin privilege admin secret 5 $1$M8D6L5B=G8J8E<O2A0G;F8D7F6A;F8I5.,*|.
no service reset-disable
                                   
spanning-tree mode rstp

snmp-server

no controller cloud-based
interface vlan 1
  ip address-alloc dhcp
  ipv6 enable
#
interface vlan 10
  no ip address                       
  description "FSD_Dept"
  no ipv6 enable
#
interface vlan 120
  no ip address
  description "Voice_VLAN"
  no ipv6 enable
#
interface gigabitEthernet 1/0/1
  switchport general allowed vlan 10 untagged
  switchport pvid 10
  spanning-tree
  
#
interface gigabitEthernet 1/0/2
  switchport general allowed vlan 10 untagged
  switchport pvid 10
  spanning-tree
  
#
interface gigabitEthernet 1/0/3
  switchport general allowed vlan 10 untagged
  switchport pvid 10
  spanning-tree                       
  
#
interface gigabitEthernet 1/0/4
  switchport general allowed vlan 10 untagged
  switchport pvid 10
  spanning-tree
  
#
interface gigabitEthernet 1/0/5
  switchport general allowed vlan 10 untagged
  switchport pvid 10
  spanning-tree
  
#
interface gigabitEthernet 1/0/6
  switchport general allowed vlan 10 untagged
  switchport pvid 10
  spanning-tree
  
#
interface gigabitEthernet 1/0/7
  switchport general allowed vlan 10 untagged
  switchport pvid 10
  spanning-tree                       
  
#
interface gigabitEthernet 1/0/8
  switchport general allowed vlan 10 untagged
  switchport pvid 10
  spanning-tree
  
#
interface gigabitEthernet 1/0/9
  switchport general allowed vlan 120 untagged
  switchport pvid 120
  spanning-tree
  
#
interface gigabitEthernet 1/0/10
  switchport general allowed vlan 120 untagged
  switchport general allowed vlan 10 tagged
  switchport pvid 120
  spanning-tree
  
#
interface gigabitEthernet 1/0/11
  shutdown
                                      
#
interface gigabitEthernet 1/0/12
  shutdown
  
#
interface gigabitEthernet 1/0/13
  shutdown
  
#
interface gigabitEthernet 1/0/14
  shutdown
  
#
interface gigabitEthernet 1/0/15
  shutdown
  
#
interface gigabitEthernet 1/0/16
  shutdown
  
#
interface gigabitEthernet 1/0/17
  shutdown
                                      
#
interface gigabitEthernet 1/0/18
  shutdown
  
#
interface gigabitEthernet 1/0/19
  shutdown
  
#
interface gigabitEthernet 1/0/20
  shutdown
  
#
interface gigabitEthernet 1/0/21
  shutdown
  
#
interface gigabitEthernet 1/0/22
  shutdown
  
#
interface gigabitEthernet 1/0/23
  switchport general allowed vlan 120 untagged
  switchport pvid 120                 
  
#
interface gigabitEthernet 1/0/24
  switchport general allowed vlan 10,120 tagged
  switchport general allowed vlan all
  
#
interface gigabitEthernet 1/0/25
  
#
interface gigabitEthernet 1/0/26
  
#
interface gigabitEthernet 1/0/27
  
#
interface gigabitEthernet 1/0/28
  
#
end  

FSD_Managed_sW#copy running-config startup-config 
 <cr>

FSD_Managed_sW#copy running-config startup-config 
 Start to save user config as the Next Startup Config file......
 Saving user config OK!

FSD_Managed_sW#


